// Operadores aritméticos
{

// ----------------------------------------------------------------------------
// Operador de soma
// ----------------------------------------------------------------------------

let a: number = 2;
let result = a + a;
console.log(result);

// ----------------------------------------------------------------------------
// Operador de subtração
// ----------------------------------------------------------------------------
let x = 10;
let y = 5;
result = x - y;
console.log(result);

// ----------------------------------------------------------------------------
// Operador de multiplicação
// ----------------------------------------------------------------------------
result = x * y * a;
console.log(result);

// ----------------------------------------------------------------------------
// Operador de divisão
// ----------------------------------------------------------------------------
result = x / y;
console.log(result);

// ----------------------------------------------------------------------------
// Operador de módulo
// ----------------------------------------------------------------------------
result = x % y;
console.log(result);

// ----------------------------------------------------------------------------
// Operadores de incremento e decremento
// ----------------------------------------------------------------------------
let i = 1;
console.log(++i); // 2
console.log(i++, i); // 2
console.log(--i); // 2
console.log(i--, i); // 2


// ----------------------------------------------------------------------------
// Concatenação
// ----------------------------------------------------------------------------

let hello = 'hello ';
let world = 'world'

let texto = hello + world;

// O resultado será hello world
console.log(texto)

let quantidade: number = 1;
let objeto: string = " carro";

let conteudo = quantidade + objeto;

// O resultado será '1 carro'
console.log(conteudo)

}